IDENTIFICATION DIVISION.    PROGRAM-ID. HELLO.    AUTHOR. A.J.LOPEZ.    INSTALLATION. TEST.    DATE-WRITTEN. 2012-12-22.    DATE-COMPILED. 2012-12-22.ENVIRONMENT DIVISION.    CONFIGURATION SECTION.        SOURCE-COMPUTER. NODE.        OBJECT-COMPUTER. NODE.DATA DIVISION.PROCEDURE DIVISION.    DISPLAY "HELLO, WORLD".