procedure division.
perform sayhello async.
perform sayworld async.

sayhello async.
display "Hello, " with no advancing.

sayworld asynchronous.
display "World".
